# -*- coding: utf-8 -*-
"""
-------------------------------------------------
File Name:        Must
Description :   
Author :          wellqin
date:             2020/3/18
Change Activity:  2020/3/18


    前序遍历，中序遍历，后序遍历；
    层次遍历；
    求树的结点数；
    求树的叶子数；
    求树的深度；
    求二叉树第k层的结点个数；
    判断两棵二叉树是否结构相同；
    求二叉树的镜像；
    求两个结点的最低公共祖先结点；
    求任意两结点距离；
    找出二叉树中某个结点的所有祖先结点；
    不使用递归和栈遍历二叉树；
    二叉树前序中序推后序；
    判断二叉树是不是完全二叉树；
    判断是否是二叉查找树的后序遍历结果；
    给定一个二叉查找树中的结点，找出在中序遍历下它的后继和前驱；
    二分查找树转化为排序的循环双链表；
    有序链表转化为平衡的二分查找树；
    判断是否是二叉查找树。

-------------------------------------------------
"""